{"class_name": "Model", "config": {"name": "generator", "layers": [{"name": "input_77", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 64], "dtype": "float32", "sparse": false, "name": "input_77"}, "inbound_nodes": []}, {"name": "input_78", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_78"}, "inbound_nodes": []}, {"name": "concatenate_39", "class_name": "Concatenate", "config": {"name": "concatenate_39", "trainable": true, "axis": -1}, "inbound_nodes": [[["input_77", 0, 0, {}], ["input_78", 0, 0, {}]]]}, {"name": "dense_123", "class_name": "Dense", "config": {"name": "dense_123", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_39", 0, 0, {}]]]}, {"name": "dense_124", "class_name": "Dense", "config": {"name": "dense_124", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_123", 0, 0, {}]]]}, {"name": "dense_125", "class_name": "Dense", "config": {"name": "dense_125", "trainable": true, "units": 162, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dense_124", 0, 0, {}]]]}, {"name": "concatenate_40", "class_name": "Concatenate", "config": {"name": "concatenate_40", "trainable": true, "axis": -1}, "inbound_nodes": [[["dense_125", 0, 0, {}], ["input_78", 0, 0, {}]]]}], "input_layers": [["input_77", 0, 0], ["input_78", 0, 0]], "output_layers": [["concatenate_40", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}