{"class_name": "Model", "config": {"name": "generator", "layers": [{"name": "input_29", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 32], "dtype": "float32", "sparse": false, "name": "input_29"}, "inbound_nodes": []}, {"name": "input_30", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "name": "input_30"}, "inbound_nodes": []}, {"name": "concatenate_15", "class_name": "Concatenate", "config": {"name": "concatenate_15", "trainable": true, "axis": -1}, "inbound_nodes": [[["input_29", 0, 0, {}], ["input_30", 0, 0, {}]]]}, {"name": "dense_94", "class_name": "Dense", "config": {"name": "dense_94", "trainable": true, "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["concatenate_15", 0, 0, {}]]]}, {"name": "dropout_16", "class_name": "Dropout", "config": {"name": "dropout_16", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_94", 0, 0, {}]]]}, {"name": "dense_95", "class_name": "Dense", "config": {"name": "dense_95", "trainable": true, "units": 256, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_16", 0, 0, {}]]]}, {"name": "dropout_17", "class_name": "Dropout", "config": {"name": "dropout_17", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_95", 0, 0, {}]]]}, {"name": "dense_96", "class_name": "Dense", "config": {"name": "dense_96", "trainable": true, "units": 512, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_17", 0, 0, {}]]]}, {"name": "dropout_18", "class_name": "Dropout", "config": {"name": "dropout_18", "trainable": true, "rate": 0.2, "noise_shape": null, "seed": null}, "inbound_nodes": [[["dense_96", 0, 0, {}]]]}, {"name": "dense_97", "class_name": "Dense", "config": {"name": "dense_97", "trainable": true, "units": 162, "activation": "tanh", "use_bias": true, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"scale": 1.0, "mode": "fan_avg", "distribution": "uniform", "seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "inbound_nodes": [[["dropout_18", 0, 0, {}]]]}, {"name": "concatenate_16", "class_name": "Concatenate", "config": {"name": "concatenate_16", "trainable": true, "axis": -1}, "inbound_nodes": [[["dense_97", 0, 0, {}], ["input_30", 0, 0, {}]]]}], "input_layers": [["input_29", 0, 0], ["input_30", 0, 0]], "output_layers": [["concatenate_16", 0, 0]]}, "keras_version": "2.2.2", "backend": "tensorflow"}